{
  "name": {
    "firstName": "Shawn",
    "lastName": "Parker",
    "title": "Tech Lead / Staff Engineer",
    "tagline": "Wookiee at Large"
  },
  "contact": {
    "address": {
      "streetAddress": null,
      "locality": "Castle Pines",
      "region": "CO",
      "postalCode": "80108",
      "countryName": "USA"
    },
    "methods": {
      "email": "shawn@topfroggraphics.com",
      "telFormatted": null,
      "telE164": null,
      "url": "https://top-frog.com"
    }
  },
  "buzzwords": [
    [
      {
        "name": "Python, Java, PHP, Scala, whatever…",
        "text": "Doesn't matter – just write tests for it!"
      },
      {
        "name": "Typescript/Javascript, SvelteKit, React, Node",
        "text": "We still love you, jQuery!<br>But we love Svelte more..."
      },
      {
        "name": "CSS, Tailwind, and even Boostrap",
        "text": "Tailwind seems to be eating the world, but I do love me some artisinally crafted CSS."
      },
      {
        "name": "REST APIs, Web Services, Cloud Functions, GraphQL",
        "text": "Y’know, all that modern web jazz that’s making a buzz on the interwebs."
      },
      {
        "name": "Greasing Wheels, Growing Engineers",
        "text": "Project/Tech specs, mentoring, planning, watering the EICs."
      },
      {
        "name": "I18n, L10n, A11y",
        "text": "I’ve learned more than I ever thought I wanted to know about character sets, locales, and externalization."
      },
      {
        "name": "PDF Generation",
        "text": "Wait, this all starts drawing from which corner now?"
      },
      {
        "name": "Version Control, Command Line Scripting, Automation & CI",
        "text": "Not very glamorous but well worth the time it takes to learn. Do you know where your .profile has been?"
      },
      {
        "name": "Mac & Linux",
        "text": "Windows use is for family tech support and cross-browser testing only."
      }
    ],
    [
      {
        "name": "WordPress Contributor",
        "text": "Mostly bug fixes and small enhancements to the WP Core, but its all for the greater good, right?"
      },
      {
        "name": "Plugin Maintainer",
        "text": "Post Password Token, est. September, 2009"
      }
    ]
  ],
  "links": [
    {
      "icon": "github",
      "href": "https://github.com/Gipetto/resume",
      "text": "View source of this Resume."
    }
  ],
  "objective": [
    "I am a full-stack software engineer with experience in distributed web systems and modern Javascript-based web application development. I have worked alone and been a part of — and led — small to medium-sized groups of engineers."
  ],
  "currentWork": [
    {
      "company": "QuizStreak",
      "location": "Castle Pines, CO",
      "url": "https://www.quizstreak.com",
      "positions": [
        {
          "from": {
            "month": 10,
            "year": 2023
          },
          "title": "Lead Developer / Co-owner",
          "description": [
            "Design and build an online trivia game using Svelte, Supabase, and custom CSS. Using a bare minimum of node modules, build features using custom components and CSS to reduce the application footprint and keep raw size to a minimum.",
            "Analyze user data and behavior, perform customer interviews, and process user feedback to determine feature usage and performance.",
            "Build job runners using edge functions and Postgres functions to update statistical user data. Build a CI pipeline using GitHub Actions to deploy and merge schema updates safely through different environments."
          ]
        }
      ]
    },
    {
      "company": "Culture Foundry",
      "location": "Vancouver, WA",
      "positions": [
        {
          "from": {
            "month": 3,
            "year": 2024
          },
          "title": "Software Engineer, Contractor",
          "description": [
            "Build custom sites on WordPress using themes based on Bootstrap and Tailwind. Extend WordPress functionality through plugins such as Advanced Custom Field or with custom-written plugins.",
            "Break down and plan development work based on client needs, mobile use, accessibility, and functionality defined in design mocks.",
            "Build workflows for automated CI and deployments onto WPEngine and customer-owned properties."
          ]
        }
      ]
    }
  ],
  "workHistory": [
    {
      "company": "RevOpos, Inc",
      "location": "Berkeley, CA",
      "positions": [
        {
          "from": {
            "month": 4,
            "year": 2022
          },
          "to": {
            "month": 3,
            "year": 2023
          },
          "title": "Lead Software Engineer",
          "description": [
            "Lead a team focused on customer and product growth. Implement new features in a Python & React/Typescript code base. Work with Product, Sales, and Support to scope and design new features. Increase application performance and reduce build size by analyzing browser performance tools and package analysis. Coach younger engineers in software development best practices, project management, and on-call response.",
            "Oversee a team of remote contractors in finalizing an internal Design System. Through code review and documentation, ensure that code quality and design pattern consistency are met."
          ]
        }
      ]
    },
    {
      "company": "Twilio",
      "location": "San Francisco, CA",
      "positions": [
        {
          "from": {
            "month": 7,
            "year": 2019
          },
          "to": {
            "month": 1,
            "year": 2022
          },
          "title": "Staff Software Engineer / Tech Lead, Growth Engineering",
          "description": [
            "Support multiple small teams in developing the signup and onboarding flow and tools to enable customer growth and learning. Working with project managers, help define features, scope, and requirements for upcoming projects. Working with the team to build scalable, fault-tolerant, tested, and easy-to-maintain systems.",
            "Coach younger engineers on approaches to engineering, build skills in breaking down projects and tasks into consumable chunks, troubleshoot problems, and commit as few sins against programming as possible along the way.",
            "Oversee a team of remote contractors. Maintain productivity by clearing roadblocks, wrangling product managers to clarify expectations, and setting clear task definitions."
          ]
        },
        {
          "from": {
            "month": 6,
            "year": 2011
          },
          "to": {
            "month": 7,
            "year": 2019
          },
          "title": "Senior Software Engineer 1 & 2",
          "description": [
            "During these years at Twilio, I was part of many different teams, including Growth Engineering / Onboarding, Experimentation Platform, Phone Numbers / Shortcodes, Console, and OpenVBX.",
            "Built a customer data platform to support the experimentation platform and enable teams to make run-time decisions about their customers based on live data and computed metrics.",
            "Designed customer workflow and built systems to support a regulatory process for provisioning phone numbers in compliance with worldwide, country-specific rules.",
            "Deconstructed a monolithic console code base to enable individual teams to support their development lifecycles, decrease contention over core sections of the codebase, and enable different teams to adopt the back-end languages that were right for them.",
            "Drove a culture of testing as a normal part of the development lifecycle Increased adoption of technologies and tooling to improve system observability and drive down recovery time from errors."
          ]
        }
      ],
      "patents": [
        {
          "type": "U.S. Patent",
          "number": "11,153,390 B2",
          "issued": "Oct. 19, 2021",
          "title": "Multi-Jurisdictional Endpoint Allocation Compliance",
          "description": [
            "A system for evaluating and verifying jurisdictional eligibility to allocate resources based on identification data and regulatory rule sets."
          ]
        }
      ]
    },
    {
      "company": "Crowd Favorite",
      "location": "Denver, CO",
      "positions": [
        {
          "from": {
            "month": 5,
            "year": 2008
          },
          "to": {
            "month": 6,
            "year": 2011
          },
          "title": "Senior Developer",
          "description": [
            "Developed custom solutions for building on and extending WordPress as a publishing platform. Developed project requirements and plans for projects ranging from plugin development or API integrations to large-scale deployments requiring careful server resource management and integration plans for different services.",
            "While the bulk of my work involved developing tools for client websites that build on and extend WordPress’s functionality, I was also responsible for developing systems built on top of CodeIgniter that take advantage of Amazon cloud services to scale to meet the demands of high-volume, time-sensitive data processing."
          ]
        }
      ]
    },
    {
      "company": "Alternative Technology",
      "location": "Englewood, CO",
      "positions": [
        {
          "from": {
            "month": 11,
            "year": 2003
          },
          "to": {
            "month": 5,
            "year": 2008
          },
          "title": "Web Developer & Designer",
          "description": [
            "Maintained the client-facing website and client portal for a hardware, software, and technical services distributor. Built a custom framework for managing product information, client portal access, and educational class schedules. Provided the marketing team with tools to help efficiently develop client communications."
          ]
        }
      ],
      "hidden": true
    }
  ],
  "education": [
    {
      "description": "Bachelor’s Degree in Visual Arts",
      "date": {
        "month": 12,
        "year": 1996
      },
      "institution": "University of Northern Colorado, Greeley, Colorado"
    }
  ]
}