{
  "config": {
    "history": {
      "bullets": true
    }
  },
  "name": {
    "firstName": "Shawn",
    "nickName": "Wookiee",
    "lastName": "Parker",
    "title": "Tech Lead / Staff Engineer with more than 20 years of experience"
  },
  "contact": {
    "address": {
      "streetAddress": null,
      "locality": "Castle Pines",
      "region": "CO",
      "postalCode": "80108",
      "countryName": "USA"
    },
    "methods": {
      "email": "shawn@topfroggraphics.com",
      "telFormatted": null,
      "telE164": null,
      "url": "https://top-frog.com"
    }
  },
  "buzzwords": [
    [
      {
        "name": "Python, Java, PHP, Scala, whatever…",
        "text": "Doesn't matter – just write tests for it!"
      },
      {
        "name": "Typescript/Javascript, SvelteKit, React, Node",
        "text": "We still love you, jQuery!<br>But we love Svelte more..."
      },
      {
        "name": "CSS, Tailwind, and even Boostrap",
        "text": "Tailwind seems to be eating the world, but I do love me some artisinally crafted CSS."
      },
      {
        "name": "REST APIs, Web Services, Cloud Functions, GraphQL",
        "text": "Y’know, all that modern web jazz that’s making a buzz on the interwebs."
      },
      {
        "name": "Greasing Wheels, Growing Engineers",
        "text": "Project/Tech specs, mentoring, planning, watering the EICs."
      },
      {
        "name": "I18n, L10n, A11y",
        "text": "I’ve learned more than I ever thought I wanted to know about character sets, locales, and externalization."
      },
      {
        "name": "PDF Generation",
        "text": "Wait, this all starts drawing from which corner now?"
      },
      {
        "name": "Version Control, Command Line Scripting, Automation & CI",
        "text": "Not very glamorous but well worth the time it takes to learn. Do you know where your .profile has been?"
      },
      {
        "name": "Mac & Linux",
        "text": "Windows use is for family tech support and cross-browser testing only."
      }
    ],
    [
      {
        "name": "WordPress Contributor",
        "text": "Mostly bug fixes and small enhancements to the WP Core, but its all for the greater good, right?"
      },
      {
        "name": "Plugin Maintainer",
        "text": "Post Password Token, est. September, 2009"
      }
    ]
  ],
  "links": [
    {
      "icon": "linkedin",
      "href": "https://www.linkedin.com/in/shawnparker",
      "text": "LinkedIn Profile"
    },
    {
      "icon": "github",
      "href": "https://github.com/Gipetto/resume",
      "text": "View source of this Resume."
    }
  ],
  "objective": [
    "I'm a full-stack software engineer with more than two decades of experience in building scalable web applications and leading cross-functional teams. I thrive in both individual and team settings, delivering high-quality solutions that combine technical excellence with user-centric design. My expertise spans distributed systems, modern JavaScript frameworks, and back-end development."
  ],
  "currentWork": [
    {
      "company": "QuizStreak",
      "location": "Castle Pines, CO",
      "url": "https://www.quizstreak.com",
      "positions": [
        {
          "from": {
            "month": 10,
            "year": 2023
          },
          "title": "Lead Developer / Co-owner",
          "description": [
            "Build an engaging online trivia game using Svelte, Supabase, and custom CSS, minimizing node modules to create a lightweight application that works well on both desktop and mobile devices.",
            "Transform game data into statistics suitable for user rankings, comparisons, and automated league categorization.",
            "Conduct user behavior analysis and customer interviews to identify feature opportunities and improve engagement."
          ]
        }
      ]
    },
    {
      "company": "Culture Foundry",
      "location": "Vancouver, WA",
      "positions": [
        {
          "from": {
            "month": 3,
            "year": 2024
          },
          "title": "Software Engineer, Contractor",
          "description": [
            "Develop custom WordPress sites using Bootstrap and Tailwind, enhancing functionality through custom code and with plugins like Advanced Custom Fields.",
            "Collaborate with clients to break down requirements and plan development work, focusing on mobile responsiveness and accessibility.",
            "Automate workflows for CI/CD pipelines across WPEngine and customer hosted environments."
          ]
        }
      ]
    }
  ],
  "workHistory": [
    {
      "company": "RevOpos, Inc",
      "location": "Berkeley, CA",
      "positions": [
        {
          "from": {
            "month": 4,
            "year": 2022
          },
          "to": {
            "month": 3,
            "year": 2023
          },
          "title": "Lead Software Engineer",
          "description": [
            "Led a team focused on customer and product growth to implement new features in Python and React/TypeScript, working closely with Product, Sales, and Support.",
            "Improved application performance by reducing build size through browser analysis and package optimization.",
            "Supervised remote contractors in finalizing an internal Design System, ensuring consistent code quality and design patterns."
          ]
        }
      ]
    },
    {
      "company": "Twilio",
      "location": "San Francisco, CA",
      "positions": [
        {
          "from": {
            "month": 7,
            "year": 2019
          },
          "to": {
            "month": 1,
            "year": 2022
          },
          "title": "Staff Software Engineer / Tech Lead, Growth Engineering",
          "description": [
            "Supported multiple teams in developing scalable and fault-tolerant systems for customer growth and onboarding.",
            "Mentored engineers on project and task management, engineering best practices, problem-solving, and code quality.",
            "Oversaw remote contractors and streamlined team productivity by clarifying expectations and task definitions."
          ]
        },
        {
          "from": {
            "month": 6,
            "year": 2011
          },
          "to": {
            "month": 7,
            "year": 2019
          },
          "title": "Senior Software Engineer 1 & 2",
          "description": [
            "Contributed to various teams, including Growth Engineering, Experimentation Platform, Phone Numbers, and Console Development.",
            "Built a customer data platform to support the experimentation platform and enable teams to make run-time decisions about their customers based on live data and computed metrics.",
            "Designed customer workflow and built systems to support a regulatory process for provisioning phone numbers in compliance with worldwide, country-specific rules.",
            "Deconstructed a monolithic console code base to enable individual teams to support their development lifecycles, decrease contention over core sections of the codebase, and enable different teams to adopt the back-end languages that were right for them.",
            "Drove a culture of testing as a normal part of the development lifecycle Increased adoption of technologies and tooling to improve system observability and drive down recovery time from errors."
          ]
        }
      ],
      "patents": [
        {
          "type": "U.S. Patent",
          "number": "11,153,390 B2",
          "issued": "Oct. 19, 2021",
          "title": "Multi-Jurisdictional Endpoint Allocation Compliance",
          "description": [
            "A system for evaluating and verifying jurisdictional eligibility to allocate resources based on identification data and regulatory rule sets."
          ]
        }
      ]
    },
    {
      "company": "Crowd Favorite",
      "location": "Denver, CO",
      "positions": [
        {
          "from": {
            "month": 5,
            "year": 2008
          },
          "to": {
            "month": 6,
            "year": 2011
          },
          "title": "Senior Developer",
          "description": [
            "Developed custom solutions for building on and extending WordPress as a publishing platform.", "Developed project requirements and plans for projects ranging from plugin development to API integrations to large-scale deployments",
            "Developed systems built on top of CodeIgniter that take advantage of Amazon cloud services to scale to meet the demands of high-volume, time-sensitive data processing."
          ]
        }
      ],
      "hidden": false
    },
    {
      "company": "Alternative Technology",
      "location": "Englewood, CO",
      "positions": [
        {
          "from": {
            "month": 11,
            "year": 2003
          },
          "to": {
            "month": 5,
            "year": 2008
          },
          "title": "Web Developer & Designer",
          "description": [
            "Maintained the client-facing website and client portal for a hardware, software, and technical services distributor. Built a custom framework for managing product information, client portal access, and educational class schedules. Provided the marketing team with tools to help efficiently develop client communications."
          ]
        }
      ],
      "hidden": true
    }
  ],
  "education": [
    {
      "description": "Bachelor’s Degree in Visual Arts",
      "date": {
        "month": 12,
        "year": 1996
      },
      "institution": "University of Northern Colorado, Greeley, Colorado"
    }
  ]
}